words = ['Հովհաննես Թումանյան', 'Գևորգ Էմին', 'Ակսել Բակունց', 'Վահան Տերյան', 'Նաիրի Զարյան', 'Րաֆֆի', 'Պերճ Պռոշյան', 'Սահակ Պարթև',
    'Դերենիկ Դեմիրճյան', 'Հովհաննես Շիրազ', 'Նար Դոս', 'Ռուբեն Սևակ', 'Լևոն Շանթ', 'Խնկո Ապեր', 'Գուրգեն Մահարի', 'Միսակ Մեծարենց',
    'Սիամանթո', 'Մուրացան', 'Դանիել Վարուժան', 'Պետրոս Դուրյան', 'Սայաթ-Նովա', 'Եղիշե Չարենց', 'Շիրվանզադե', 'Պարույր Սևակ', 'Խաչատուր Աբովյան',
    'Ավետիկ Իսահակյան', 'Ստեփան Զորյան', 'Արտաշես Ա Բարի', 'Սարդուրի Ա', 'Իշպուինի', 'Արգիշտի Ա', 'Տիգրան Բ Մեծ', 'Արտավազդ Ա', 'Տրդատ Ա',
    'Խոսրով Գ Կոտակ', 'Տրդատ Գ Մեծ', 'Պապ թագավոր', 'Վռամշապուհ թագավոր', 'Աշոտ Ա', 'Աշոտ Երկաթ', 'Աշոտ Գ Ողորմած', 'Սմբատ Բ Տիեզերակալ',
    'Գագիկ Ա Շահնաշահ', 'Արամ mp3', 'Միհրան Ծառուկյան', 'Արփի Գաբրիելյան', 'Գոռ Հակոբյան', 'Բեն Ավետիսյան', 'Գրիգոր Դանիելյան', 'Գոռ Եփրեմյան',
    'Անդրե', 'Անդրանիկ Օզանյան', 'Անի Երանյան', 'Արկադի Դումիկյան', 'Բիլ Գեյթս', 'Լեո Մեսսի', 'Ռոնալդու', 'Պելե', 'Մառադոննա', 'Ռոբերտ Լեվանդովսկի',
    'Ռոնալդինյո', 'Նիկոլ Փաշինյան', 'Սերժ Սարգսյան', 'Ռոբերտ Քոչարյան', 'Վլադիմիռ Պուտին', 'Դոնալդ Թռամպ', 'Ջորջ Վաշինգթոն', 'Նապոլեոն Բոնապարտ',
    'Ստալին', 'Վանգա', 'Նաստրադամուս', 'Ալբերտ Էնշտեյն', 'Նյուտոն', 'Չարլզ Դարվին', 'Չառլի Չապլին', 'Քրիստինա Եղոյան', 'Վահե Զիրոյան', 'Կարեն Ասլանյան',
    'Լիլի Մորտո', 'Գարիկ Պապոյան', 'Գրիգ Գևորգյան', 'Սոնա Ռուբինյան', 'Լուիզա Ներսիսյան', 'Լեբռոն Ջեյմս', 'Կոբի Բռեյնտ', 'Ռաֆայել Երանոսյան',
    'Քիմ Քարդաշյան', 'Գագիկ Ծառուկյան', 'Գալուստ Սահակյան', 'Լեոնարդո Դիկաբրիո', 'Սթիվ Սփիլբերգ', 'Հովհաննես Ադամյան', 'Դմիտրի Մենդելեև',
    'Արիստոտել', 'Դավիթ Անհաղթ', 'Սասունցի Դավիթ', 'Մսրա Մելիք', 'Մեսրոպ Մաշտոց', 'Գրիգոր Լուսավորիչ', 'Եղիշե պատմիչ', 'Ագաթանգեղոս', 'Փավստոս Բյուզանդ',
    'Վիլյամ Սարոյան', 'Պյոտր Ա', 'Հիտլեռ', 'Նազենի Հովհաննիսյան', 'Արմո', 'Արմենչիկ', 'Էրիկ Կարապետյան', 'Վաչե Թովմասյան', 'Ալեքսանդր Թամանյան',
    'Գաբրիել Սունդուկյան', 'Գևորգ Մարտիրոսյան', 'Գևորգ Չաուշ', 'Աղբյուր Սերոբ', 'Դմիտրի Մեդվեդեվ', 'Վազգեն Սարգսյան', 'Մոնթե Մելքոնյան',
    'Արմեն Սարգսյան', 'Այվազովսկի', 'Հովսեփ Էմին', 'Իսրայել Օրի', 'Մարտիրոս Սարյան', 'Լեոնարդո դա Վինչի', 'Բոտիչելի', 'Պաբլո Պիկասո', 'Կոմիտաս',
    'Արամ Խաչատրյան', 'Լյուդվիգ վան Բեթհովեն', 'Մոցարտ', 'Ժաննա Դարկ', 'Կորյուն պատմիչ', 'Ղազար Փարպեցի', 'Մովսես Խորենացի', 'Վարդան Մամիկոնյան',
    'Վահան Մամիկոնյան', 'Մուշեղ Մամիկոնյան', 'Ստեփանոս Օրբելյան', 'Գարեգին Բ կաթողիկոս', 'Եսայի Հասան Ջալալյան', 'Արսեն Սաֆարյան',
    'Արամե', 'Ներսիկ Իսպիրյան', 'Արաբո Իսպիրյան', 'Գրիգորի Եսայան', 'Հարութ Փամբուկչյան', 'Անանիա Շիրակացի', 'Եզոպոս', 'Վարդան Այգեկցի',
    'Մխիթար Գոշ', 'Զևս աստված', 'Անահիտ աստվածուհի', 'Վահագն Վիշապաքաղ', 'Տորք Անգեղ', 'Աստղիկ դիցուհի', 'Հիսուս Քրիստոս', 'Ալեքսանդ Մակեդոնացի',
    'Մարկոս Կրասոս', 'Հուլիոս Կեսար', 'Գնեոս Պոմպեոս', 'Ռուդբեն Եսայան', 'Սթիվ Ջոբս', 'Մարկ Ցուկերբերգ', 'Բիլ Գեյթս', 'Շառլ Ազնավուր', 'Ներսես Մեծ',
    'Արշակ Բ', 'Շապուհ', 'Արա Գեղեցիկ', 'Հովսեփ Վայոցձորեցի', 'Վասակ Սյունի', 'Սողոմոն Թեհլերյան', 'Մենուա', 'Քրիստափոր Կոլուբոս', 'Էմանուել Մակրոն',
    'Էդուարդ Քալանթարյան', 'Լիլի Հովեր', 'Գագիկ Սուրենյան', 'Սոս Ջանիբեկյան', 'Վարդան Սարգսյան', 'Հայկ Մարության', 'Գրիշա Աղախանյան', 'Լևոն Արոնյան',
    'Հենրիխ Մխիթարյան', 'Նազիկ Ավդալյան', 'Արթուր Ալեքսանյան', 'Ջեկի Չան', 'Բրյուս Լի', 'Արմուշ', 'Անդրանիկ Հարությունյան', 'Մհեր Մկրտչյան', 'Արմեն Ջիգարխանյան',
    'Սիլվա Կապուտիկյան', 'Հարի Փոթեր', 'Յուրի Գագարին', 'Նիր Արմսթրոնգ', 'Ավետ Բարսեղյան', 'Լուի վան Գոգ', 'Սոնա Եսայան', 'Հակոբ Կոջոյան',
    'Միքայել Նալբանդյան', 'Տիմատի', 'Եգոր Կրիդ', 'Նիգ Եգիպյան', 'Շակիրա', 'Սոսո Պավլիաշվիլի', 'Մարտին Մկրչյան', 'Հռիփսիմե Հակոբյան', 'Սիրուշտ',
    'Ալլա Լևոնյան', 'Նունե Եսայան', 'Լեդի Գագա', 'Լիլիթ Հովհաննիսյան', 'Սարո Թովմասյան', 'Ալլա Պուգաչովա', 'Ջո Բայդեն', 'Մենուա Մեհրաբյան',
    'Սիլվա Հակոբյան', 'Քրք Քրքորյան', 'Իվետա Մուկուչյան', 'Մայկ Թայսոն', 'Մուհամեդ Ալլի', 'Քոնեռ Մագռեգոռ', 'Խաբիբ Նուրմագովեդով', 'Նեյմառ',
    'Ա. Ս. Պուշկին', 'Ֆյոդոր Դաստաևսկի', 'Լեվ Տոլստոյ', 'Անջելինա Ջոլի', 'Անտոն Չեխով', 'Մաքսիմ Գորկի', 'Շեռլոկ Հոմս', 'Մայքլ Ջորդան', 'Գալիլեյո Գալիլեյ',
    'Բուդդա', 'Արիստոտել', 'Չինգիզխան', 'Թոմաս Էդիսոն', 'Միքելանջելո', 'Էռնեստ Ռեզերֆորդ', 'Վասկո դա Գամա', 'Հենրի Ֆորդ', 'Նոյ', 'Հայկ Նահապետ',
    'Բել', 'Բիլի Այլիշ', 'Ռիհաննա', 'Ջաստին Բիբեռ', 'Սելենա Գոմեզ', 'Միխաիլ Լերմոնտով', 'Պյութագորաս', 'Էվկլիդես', 'Արքիմեդ', 'Ֆիբոնաչի',
    'Նահապետ Քուչակ', 'Գրիգոր Նարեկացի', 'Ռափայել Պատկանյան', 'Պետրոս Դուրյան', 'Լևոն Շանթ', 'Հրանտ Մաթևոսյան', 'Էվանջեելիստա Տորիչելի',
    'Մկրտիչ Արզումանյան', 'Տիտոս Ցելսուս', 'Գարեգին Նժդեհ', 'Մայքլ Ջեքսոն', 'Նիկոլայ Բասկով', 'Ֆիլիպ Կիռկոռով', 'Քենյ Ուեսթ', 'Անգելա Մերկել',
    'Նիկիտա Խրուշչով', 'Նաիրա Զոհրաբյան', 'Հրանտ Թոխատյան', 'Ձմեռ պապ', 'Ձյունանուշիկ', 'Ջուլիա Ռոբերտս', 'Մարկ Տվեն', 'Հովհաննես Բաղրամյան',
    'Արկադի Տեր Թադևոսյան', 'Աղաս Մանուկայն', 'Ջեֆ Բեզոս', 'աթոռ', 'սեղան', 'պահարան', 'ծաղկաման', 'բազկաթոռ', 'բազմոց', 'մահճակալ', 'լուսամփոփ', 'աստիճան', 'գիրք', 'տետր', 'մատիտ',
    'կազմ', 'սրիչ', 'ծաղիկ', 'մոխրաման', 'ծխախոտ', 'ձեռք', 'մատ', 'շախմատ', 'շաշկի', 'մազ', 'վարս', 'նկար', 'պատկեր', 'տուփ', 'արկղ',
    'անձեռոցիկ', 'ծունկ', 'ոտք', 'կոճակ', 'զգեստ', 'տաբատ', 'կոշիկ', 'հող', 'աչք', 'հոնք', 'ճակատ', 'շրթունք', 'քիթ', 'ականջ', 'հիմք', 'արմատ',
    'կոդ', 'ցողուն', 'տանձ', 'դեղձ', 'ծիրան', 'բանան', 'արքայախնձոր', 'կիվի', 'կատու', 'շուն', 'փիղ', 'ձի', 'արքա', 'թագուհի', 'կայսր', 'տնկի',
    'հեռուստացույց', 'հեռախոս', 'պլանշետ', 'նոութբուք', 'տանկ', 'ինքնաթիռ', 'ուղղաթիռ', 'հյութ', 'սուրճ', 'զինանշան', 'դրոշ', 'հաշվիչ',
    'կրիա', 'վագր', 'առյուծ', 'ճանճ', 'աղվես', 'նավ', 'մեքենա', 'բույս', 'նապաստակ', 'բանալի', 'ուղի', 'ճանապարհ', 'մայրամուտ',
    'կարճատև', 'թև', 'հզոր', 'ուժ', 'ուշ', 'վաղ', 'առավոտ', 'երեկո', 'սիրտ', 'կյանք', 'ստամոքս', 'վարդ', 'մանուշակ', 'զարդ',
    'թևնոց', 'վզնոց', 'վազել', 'կռահել', 'կլոր', 'ուղղանկյուն', 'քառակուսի', 'շրջան', 'շրջանակ', 'կող', 'կողակից', 'կից', 'վարորդ', 'հեռու', 'մոտակա',
    'թխկի', 'խնձորենի', 'երիցուկ', 'պատուհան', 'երաշտ', 'երգ', 'երաժշտություն', 'երգիչ', 'երգահան', 'պարել', 'պարուհի', 'հեծանիվ', 'այրուձի',
    'ժպիտ', 'Աստված', 'նվեր', 'պարգև', 'հասցե', 'հասցնել', 'կազմել', 'պլանավորել', 'ժամացույց', 'վերնաշապիկ', 'շապիկ', 'սիրուն', 'տգեղ',
    'բռնակ', 'կոտրել', 'թողնել', 'ազատ', 'ասել', 'բացատրել', 'թիմ', 'խաղ', 'ուշանալ', 'քաշել', 'թիվ', 'թվանշան', 'լեզու', 'եռալ', 'վոլեյբոլ', 'ֆուտբոլ',
    'առաջ', 'ընկեր', 'դուրս գալ', 'բացել', 'գերան', 'ինչ', 'պարզ', 'բարձ', 'գնալ', 'զբաղվել', 'հառաչել', 'թալիսման', 'խոհանոց', 'աշխատել', 'մայր',
    'հայր', 'ճամբար', 'մտածել', 'ավարտել', 'բարև', 'իհարկե', 'կներես', 'շահել', 'հաղթել', 'առավելություն', 'դիետա', 'գյուղ', 'հանել', 'համ',
    'հոտ', 'գույն', 'թոռ', 'ծոռ', 'երազ', 'կիրակի', 'շաբաթ', 'ուրբաթ', 'չորեքշաբթի', 'երեքշաբթի', 'երկուշաբթի', 'հինգշաբթի', 'ծեծել', 'մոռանալ',
    'իմանալ', 'սկիզբ', 'խառնել', 'հավ', 'աքլոր', 'ապացույց', 'մեղադրանք', 'հեռանալ', 'րոպե', 'ժամ', 'գրամ', 'կիլոգրամ', 'տարի', 'դար', 'վայրկյան',
    'մեղադրանք', 'դասամիջոց', 'սերիա', 'եթերաշրջան', 'լսել', 'ճիշտ', 'չեմպիոն', 'հարուստ', 'աղքատ', 'համեստ', 'ձու', 'ձվածեղ', 'ֆոն',
    'վատ', 'մանկապարտեզ', 'երեխա', 'շփվել', 'մատուցող', 'հիանալ', 'կանչել', 'ջուր', 'բաժակ', 'բռնել', 'կախիչ', 'ինքնասպան', 'ակնոց',
    'կնճիռ', 'հետաքրքիր', 'սենյակ', 'գովազդ', 'կաթ', 'կով', 'կերակուր', 'շենք', 'գնդակ', 'գորշ', 'մութ', 'մռայլ', 'մուկ', 'մկնիկ', 'ականջակալ',
    'մաստակ', 'դիմակ', 'գալ', 'փախնել', 'անտառ', 'ձողիկ', 'զբոսնել', 'մեջտեղ', 'միջավայր', 'արջ', 'գլուխ', 'ուտել', 'ատամ', 'լյարդ', 'կավիճ',
    'ֆիդայի', 'հայտարարել', 'կանգառ', 'ոստիկանություն', 'հիվանդանոց', 'կիրք', 'ցանկանալ', 'կանգնած', 'նստած', 'թաքուն', 'գաղտնի',
    'երկինք', 'երկիր', 'Մերկուրի', 'Սատուրն', 'արև', 'ոսկի', 'արծաթ', 'ալմաստ', 'զմրուխտ', 'մարգարիտ', 'գոհար', 'Սատուրն', 'Յուպիտեր', 'Նեպտուն',
    'Պլուտոն', 'գալակտիկա', 'սև', 'կանաչ', 'կապույտ', 'կարմիր', 'վարդագույն', 'սպիտակ', 'փայլ', 'փայլուն', 'շարք', 'պատժել', 'կոմպոզիտոր',
    'երկնիշ', 'հետհաշվարկ', 'հերոս', 'յոգուրտ', 'դուռ', 'դռնապահ', 'զեյթուն', 'բարձրախոս', 'մեծահոգի', 'հոգի', 'ոգի', 'գլխարկ', 'օգնություն',
    'դելֆին', 'շնաձուկ', 'կետ', 'ստորակետ', 'բազմակետ', 'վերջակետ', 'միջակետ', 'փայտ', 'արշավ', 'նստարան', 'բարձր', 'կիսատ', 'լրիվ',
    'սպորտ', 'հարված', 'ծով', 'գետ', 'գետափ', 'լիճ', 'օվկիանոս', 'չակերտ', 'քարտեզ', 'խաչ', 'ուտելիք', 'անապատ', 'եվրոպա', 'ասիա', 'աֆրիկա',
    'կղզի', 'թերակղզի', 'թանաք', 'թշնամի', 'թերի', 'թույն', 'թուլացնել', 'թաց', 'մածուն', 'թթվասեր', 'սեր', 'հարգանք', 'պատիվ', 'հմայք', 'գրական',
    'պայմանագիր', 'հաստատել', 'կնիք', 'պատճե', 'պատճենել', 'խաբել', 'շփոթվել', 'կտրել', 'կոտրել', 'լցնել', 'շարժել', 'մոտեցնել', 'տեղափոխել',
    'ուտել', 'շնչել', 'թողնել', 'ծածկել', 'տեղադրել', 'համացանց', 'ինֆորմացիա', 'հանրագիտարան', 'այգի', 'վարկ', 'շքանշան', 'պաշտոն', 'կապվել',
    'գրել', 'հիանալ', 'ծանոթանալ', 'շփվել', 'խանդել', 'տարվել', 'շոգել', 'շոգ', 'տոթ', 'սառը', 'սառը', 'դառը', 'կծու', 'թթու', 'հով', 'զով', 'հովիվ',
    'դերասան', 'մանուկ', 'պատանի', 'հանդիսատես', 'կցել', 'կեղծել', 'կավ', 'տոն', 'օր', 'ամիս', 'գին', 'արժեք', 'պողպատ', 'ալյումին', 'քերել',
    'հավաքել', 'լցնել', 'քար', 'քոր', 'սար', 'ձոր', 'ոզնի', 'ռետին', 'սրբիչ', 'սազել', 'բռնել', 'կռահել', 'կրկնօրինակ', 'եղնիկ', 'գոհ', 'դժգոհ', 'բակ',
    'ետնաբակ', 'երկիր', 'համերգ', 'մենահամերգ', 'քարոզ', 'աղբ', 'ակտ', 'հաշիվ', 'տուֆ', 'բազալտ', 'աղ', 'ուղտ', 'ուխտ', 'ընձուղտ', 'կենդանի',
    'հովազ', 'որդի', 'դուստր', 'ծեր', 'տարեց', 'մեծահասակ', 'արագաչափ', 'հապավում', 'կիրճ', 'բլուր', 'նրբերշիկ', 'պանիր', 'կարագ', 'հաց',
    'հակառակ', 'հակադիր', 'համով', 'հոլով', 'եղանակ', 'ձմեռ', 'ամառ', 'աշուն', 'գարուն', 'գլան', 'պրիզմա', 'զանգված', 'զինվել', 'հագուստ', 'լող',
    'նկար', 'նկարչություն', 'կատակ', 'հումոր', 'արվեստ', 'արհեստ', 'պատրվակ', 'պատանդ', 'վճար', 'դոլլար', 'արժույթ', 'գդալ', 'գթալ', 'խղճալ',
    'հասկանալ', 'ստեղծել', 'քամել', 'անգիր', 'թուղթ', 'հնար', 'հիվանդ', 'գրավել', 'պաշտպանել', 'հպարտ', 'ընկերասեր', 'ընկեր', 'ընկերուհի',
    'լսել', 'քնել', 'ոսկոր', 'կապիկ', 'վիշապ', 'դինոզավռ', 'բառ', 'բարդ', 'պարզ', 'միջնեկ', 'ավագ', 'ամենափոքր', 'գլորվել', 'սառել', 'պաղպաղակ',
    'քլոր', 'թթվածին', 'ածխաթթու գազ', 'կրակ', 'օդ', 'օդաչու', 'նավաստի', 'ջրածին', 'ցինկ', 'կապար', 'քիմիա', 'ֆիզիկա', 'կենսաբանություն', 'ածանց',
    'աշխարհագրություն', 'ձև', 'ընդհանուր', 'կեղտոտ', 'ստոր', 'ստրուկ', 'սպանել', 'սնվել', 'սպասել', 'չհամբերել', 'սառույց', 'գոլորշի', 'բու',
    'մասնագետ', 'վարսահարդար', 'հարդարել', 'հարս', 'փեսա', 'նորանշանակ', 'նորեկ', 'նա', 'ես', 'մենք', 'դու', 'յուրաքանչյուր', 'նրանք', 'դուք',
    'հյուր', 'բարեկամ', 'անդամ', 'քանակ', 'օճառ', 'հեղուկ', 'պինդ', 'գազ', 'դարպաս', 'լույս', 'լուսավոր', 'անշունչ', 'շնչավոր', 'կեղև',
    'պատճառ', 'անձրև', 'ծիածան', 'արցունք', 'արդյունք', 'քրտինք', 'մահ', 'ծնունդ', 'վառ', 'վառել', 'վազք', 'ոսպնյակ', 'կարճատես', 'հեռատես',
    'բազում', 'շատ', 'ավելի', 'ավել', 'ասպարեզ', 'բեմ', 'վերմակ', 'էներգիա', 'հոսանք', 'չնչին', 'չվել', 'տաք', 'հարմար', 'հորդորել', 'բարկանալ',
    'գոռալ', 'երազել', 'երգել', 'կանչել', 'առևանգել', 'անհամբեր', 'համբերատար', 'երիկամ', 'երիցուկ', 'եզր', 'եզրագիծ', 'կենտրոն', 'մաս', 'հազար',
    'ներել', 'անփորձ', 'լոլիկ', 'ձմերուկ', 'սեխ', 'կարտոֆիլ', 'նարինջ', 'պնդուկ', 'պոպոք', 'միջուկ', 'ստել', 'լալ', 'կաղամբ', 'թուփ', 'տոլմա', 'ամանոր',
    'հուր', 'պայծառ', 'շող', 'հրեշտակ', 'դև', 'դդում', 'ցորեն', 'բրինձ', 'կախարդ', 'հրաշք', 'աճպարար', 'անհնար', 'արթւն', 'ուլ', 'անիմաստ', 'զոհ',
    'անմեղ', 'մեղավոր', 'հարկավոր', 'մարտկոց', 'հորինել', 'գործակից', 'տախտակ', 'դժողք', 'դրախտ', 'հատակ', 'երկհարկանի', 'լողավազան',
    'թռիչք', 'դհոլ', 'ճյուղ', 'ճրագ', 'ճիշտ', 'լուր', 'սցենար', 'պայմանավորվել', 'ուրախանալ', 'վայելել', 'սահմանափակ', 'անսահման', 'սունկ',
    'վերջացնել', 'գուցե', 'ման գալ', 'կին', 'ամուսին', 'երկրաչափություն', 'տեղ', 'փնտրել', 'եռանկյուն', 'բարենպաստ', 'քավոր', 'ներողություն', 'սուտ',
    'ճանաչել', 'ֆանտազիա', 'գլխավոր', 'նորմալ', 'մարդ', 'մարդիկ', 'այլմոլորակային', 'բնական', 'վերլուծել', 'մոդել', 'խնդրել', 'կասկած', 'դրամարկղ',
    'պնդել', 'դեկտեմբեր', 'սիրելի', 'տաքսի', 'նստել', 'կարմրել', 'երանգ', 'սարդ', 'խանութ', 'սուպերմարկետ', 'կոտորակ', 'ընտրել', 'կերպար', 'սազել',
    'հիանալ', 'ռազմագետ', 'մաղթել', 'հաջողություն', 'շնորհակալ', 'հանդիպել', 'իրավունք', 'ոչնչացնել', 'իրավաբան', 'կարևոր', 'վայր', 'սիրելի',
    'խելք', 'ուղեղ', 'գործազուրկ', 'արտագաղթ', 'խորհուրդ', 'հարվածել', 'սնվել', 'մագնիս', 'բիբ', 'տանել', 'խղճալ', 'կրկնություն', 'շոկի գալ', 'զարմանալ',
    'մոռանալ', 'տղա', 'աղջիկ', 'մեծանալ', 'փոքրանալ', 'մենյու', 'վրեժ', 'ռեստորան', 'սրճարան', 'հայրություն', 'հրապարակ', 'տոկոս', 'զեղչ', 'նման',
    'շարժում', 'տարբերություն', 'համամատել', 'խոսք', 'փնտրել', 'առաքել', 'տեղյակ', 'շփվել', 'կոշտ', 'պայքարել', 'լիովին', 'ծնողներ', 'չար', 'ընտանիք',
    'խելոք', 'դիմել', 'եղբայր', 'քույր', 'դիմաց', 'առաստաղ', 'տուն', 'տնակ', 'աջլիկ', 'ձախլիկ', 'ձայն', 'ականջօղ', 'վեր կենալ', 'ավիրել', 'թղթապանակ',
    'հոտավետ', 'ասույթ', 'բանաստեղծություն', 'պահակ', 'դիակ', 'ոհմակ', 'ալիք', 'խմիչք', 'կոնյակ', 'գինի', 'օղի', 'մութ', 'նկատել', 'ապտակել', 'լուսին',
    'հույս ունենալ', 'դիմանալ', 'ֆունկցիա', 'բանաձև', 'անհոգ', 'տպագիր', 'ձեռագիր', 'կանգառ', 'արծիվ', 'ծողկեփունջ', , 'ճախրել', 'միլիոն', 'միլիարդ',
    'մարգարե', 'նվագախումբ', 'վահանագեղձ', 'թոնիր', 'հետք', 'ոտնահետք', 'որոշել', 'շահագործել', 'այբբենարան', 'հույս', 'յասաման',
    'հոգեվարք', 'կերակրափող', 'խղճալ', 'խարույկ', 'բանտարկյալ', 'բանտ', 'նյութ', 'մանրէ', 'էակ', 'կոպիտ', 'լուսանկարիչ', 'սկավառակ', 'նկարազարդում',
    'պաշտոնական', 'պահեստային', 'լքել', 'ածուխ', 'ենթադրել', 'տնային տնտեսուհի', 'լիցքավորում', 'սպառել', 'սպորտ', 'վրան', 'վտակ',
    'երգահան', 'բառատետր', 'դիմանալ', 'դիմակահանդես', 'տարակուսանք', 'աստղագիտություն', 'աստղադիտարան', 'խայտառակ', 'հարևան', 'լաց',
    'ճաշասենյակ', 'աշտարակ', 'ժամագործ', 'ներգաղթ', 'տատանում', 'թիրախ', 'նիզակ', 'աղեղ', 'լար', 'թել', 'զենք', 'հրացան', 'քլոր', 'մկրտութուն',
    'գրողների միություն', 'ավելորդ', 'կակտուս', 'կրիա', 'նամականիշ', 'ուլտրամանուշակագույն', 'չքավոր', 'պատրանք', 'անհեթեթություն', 'ամպրոպ',
    'ակցիա', 'լարել', 'դրամարկղ', 'տպիչ', 'սնկապուր', 'հոգալ', 'վախենալ', 'մարդահամար', 'լի', 'երկրորդ', 'երրորդ', 'առաջին', 'կաթողիկոս', 'տալ',
    'դասադուլ', 'փոխարժեք', 'գործադուլ', 'եպիսկոպոս', 'հարսնաքույր', 'փարավոն', 'գանգատ', 'ցավ', 'ցեխ', 'ծննդավայր', 'քաղց', 'առաջադիմություն',
    'խրթին', 'գլխատել', 'ջենտլմեն', 'աղմկել', 'մողես', 'կառավարություն', 'ծոծրակ', 'համր', 'դիզել', 'չղջիկ', 'ազգական', 'թնդանոթ', 'աններելի', 'կարիճ',
    'ընդհանրացնել', 'լրացուցիչ', 'ներկ', 'ծախս', 'տեսանելի', 'փոքրաթիվ', 'գրանիտ', 'պարունակել', 'հերթ', 'օրիգինալ', 'որովայն', 'պարկեշտ', 'ալյուր',
    'հետմահու', 'արտադրել', 'դահլիճ', 'ցանք', 'գրքույկ', 'գարի', 'նամակ', 'պատվեր', 'անհավատ', 'բազե', 'սուր', 'բութ', 'արագաշարժ', 'դայակ',
    'դղյակ', 'շքեղ', 'խորհրդանիշ', 'մոլորվել', 'պահապան', 'վերջնական', 'հեռախոսազրույց', 'ցունամի', 'ներդրում', 'օձիք', 'շրթունք', 'համբույր',
    'հարցաթերթիկ', 'մաքրել', 'հարմարություն', 'գանձ', 'օպերա', 'ուսուցանել', 'ամեոբա', 'անկախություն', 'վնասակար', 'օրենսգիրք', 'խավիար',
    'քքարայծ', 'երբեք', 'միշտ', 'առմիշտ', 'հնարավոր', 'աղբաման', 'սրամիտ', 'ջրաներկ', 'անտանելի', 'արտակարգ', 'սրբագրել', 'մատրիցա',
    'օբյեկտ', 'սուբյեկտ', 'մուլտֆիլմ', 'փեթակ', 'մենեջեր', 'անմիտ', 'ձիթայուղ', 'կանաչապատել', 'միջակետ', 'խխունջ', 'զանգակ', 'աճ', 'քարտուղարուհի',
    'թերի', 'ջնթերցասրահ', 'կրակայրիչ', 'արտասվել', 'հուզվել', 'հույզ', 'վակում', 'իշխել', 'ըմպելիք', 'ամփոփել', 'փորձություն', 'կեռ', 'մետր', 'անգինա',
    'երամ', 'իրոք', 'սպիրտ', 'կակաո', 'փոշի', 'փշոտ', 'հերթապահ', 'կենտրոն', 'բաժին', 'նռնակ', 'պայթյուն', 'ատամնաշար', 'սագ', 'թռչուն',
    'ծիածան', 'ձյուն', 'անձրև', 'կայծակ', 'տոնական', 'ոսկե', 'մատանի', 'հարսանիք', 'նշանդրեք', 'փոխանակվել', 'մեկմեկու', 'շինել', 'օլորել',
    'կոտրել', 'կոտորել', 'այլայլված', 'անճանաչելի', 'մշակել', 'դաղել', 'դեղ', 'հաբ', 'մաշվել', 'փչանալ', 'դեռահաս', 'փուչիկ', 'ամպ', 'ամպամած',
    'ուղղահայաց', 'հորիզոնական', 'հորիզոն', 'կատար', 'լեռնալանջ', 'գագաթ', 'ծայր', 'ծորալ', 'թափվել', 'քաշել', 'գնել', 'պարտք', 'չափահաս',
    'հիվանդություն', 'բազմաստված', 'կրոն', 'դավանել', 'պաշտել', 'կուռք', 'կեղծ', 'ստոր', 'դարբին', 'թուր', 'սուր', 'կացին', 'վառելափայտ', 'դանակ',
    'պտուտակիչ', 'սղոց', 'սրբել', 'բալ', 'բազմել', 'գրավել', 'պարտության մատնել', 'մատնել', 'առաքյալ', 'աշակերտ', 'ուսանող', 'դասախոս', 'դասատու',
    'լսարան', 'դասարան', 'լուսամփոփ', 'առաստաղ', 'մետաղ', 'քիմիական տարր', 'տառ', 'զույգ', 'եռյակ', 'ծնունդ', 'ուրախություն', 'առիթ', 'խմիչք',
    'ոգի', 'հոգի', 'հեծանիվ', 'սայլակ', 'սայլ', 'անուղղակի', 'ուղղել', 'ճշտել', 'պարզել', 'չափել', 'գումարել', 'լոգարան', 'իրավունք', 'պարտականություն',
    'պատվեր', 'առաքիչ', 'երփներանգ', 'գույնզգույն', 'յուրահատուկ', 'հատուկ', 'հասարակ', 'սակավ', 'սողալ', 'սողուն', 'սլանալ', 'հավելված',
    'ծրագիր', 'ծրագրել', 'շնչել', 'խորհուրդ', 'կողմնակի', 'երկրորդական', 'տալ', 'տնտեսություն', 'հողագործություն', 'գյուղացի', 'աշխատունակ',
    'տնակ', 'քաղցած', 'շտապել', 'հրշեջ', 'առևանգել', 'փրկագին', 'ֆտոր', 'թենիս', 'լող', 'լողալ', 'լեզվակ', 'հայ', 'համառ', 'հստակ', 'ներս', 'դուրս',
    'դատարկ', 'դիմել', 'բողոքել', 'քաղաքապետ', 'քաղաքապետարան', 'գյուղապետ', 'գյուղապետարան', 'պատգամավոր', 'պատգամ', 'աշխատավարձ',
    'տրամադրել', 'տրամադրվել', 'ծնկի գալ', 'ցնդել', 'ցածր', 'վերնագիր', 'նախաբան', 'համառոտ', 'կոնկրետ', 'բեռ', 'բեռնատար', 'մեծածախ',
    'մանրածախ', 'բավարատվող', 'հավատարիմ', 'կանգուն', 'կանգնել', 'պատվավոր', 'կոլեգա', 'գարծընկեր', 'միջանցք', 'կարոտ', 'կարոտել', 'կախել',
    'վատնել', 'ծրար', 'ձնառատ', 'ծագում', 'անձրևոտ', 'շաքար', 'շաքարավազ', 'ամենայն', 'նահանգ', 'մարզ', 'հրատապ', 'հսկա', 'հսկել', 'բազմել',
    'պղպեղ', 'դադարել', 'դողալ', 'հանգստանալ', 'կեղծել', 'կոտրվածք', 'ավտովթար', 'դեմ դիմաց', 'երկրաշարժ', 'ցելսուս', 'մագնիտուդ', 'բորբոքվել',
    'կարմրել', 'ջրծաղիկ', 'կարմրուկ', 'ի ծնե', 'ի սկզբանե', 'տատիկ', 'պապիկ', 'սիրելիս', 'հնազանդ', 'տեր', 'տանուտեր', 'տիրել', 'հնազանդվել',
    'հեռանկար', 'ապագա', 'անկաշկանդ', 'նպատակասլաց', 'սխրանք', 'հերոսություն', 'անմահություն', 'ցմահ', 'ցտեսություն', 'ցայտուն', 'լեցուն',
    'իրավացի', 'դանդաղաշարժ', 'սլացիկ', 'թոռնուհի', 'թելադրել', 'թելադրություն', 'շարադրել', 'շարադրութուն', 'փոխադրել', 'փոխադրվել',
    'փոխադրություն', 'վարժություն', 'համեմատություն', 'վարժել', 'համեմատել', 'պարապել', 'պարապունք', 'անգործ', 'գործազուրկ', 'հեռացնել',
    'բարիք', 'խաղաղություն', 'համաշխարհային պատերազմ', 'պատերազմ', 'ճակատամարտ', 'մարտ', 'մարտնչել', 'մասուր', 'կոմպոտ', 'մալինա', 'ելակ',
    'թանաք', 'մոխիր', 'քարածուխ', 'փայտածուխ', 'թունավոր', 'փաթեթ', 'տնային աշխատանք', 'փաթեթավորել', 'սրտանց', 'դամբարան',
    'գերեզման', 'կառավարում', 'կառավարիչ', 'վարչապետ', 'նախագահ', 'հանրային', 'հռետոր', 'խոսնակ', 'բացատրել', 'քննիչ', 'ոստիկանություն',
    'ձերբակալել', 'մահապատիժ', 'դատարան', 'դատել', 'դատավոր', 'գերարագ', 'փաստաբան', 'վաճառված', 'կիսվել', 'վանկ', 'տողադարձ', 'տապան',
    'տիեզերք', 'հումոր', 'տարբերակ', 'այո', 'կռահել', 'օծանելիք', 'ամուսին', 'ծեծել', 'թվալ', 'երևակայել', 'պահել', 'կերպար', 'անձնագիր', 'ծափահարություն',
    'տիկին', 'հասկանալ', 'տող', 'հասմիկ', 'աստղ', 'հեռադիտակ', 'դեպք', 'հարց', 'խնամի', 'բաժանվել', 'թագ', 'թանկարժեք քար', 'ակ', 'ռետին',
    'ճկուն', 'փոքրիկ', 'կույր', 'խուլ', 'հարստանալ', 'հայտնի', 'ծրագրավորող', 'հակաթույն', 'դիզայն', 'արևածաղիկ', 'տանգո', 'պար', 'պարել',
    'քոչարի', 'քոչվոր', 'ամրոց', 'դահուկ', 'չմուշկ', 'ազգանուն', 'անուն', 'անիրական', 'բայց', 'սիրահարվել', 'կարևոր', 'խաղ', 'իմանալ', 'սիրել',
    'միայն', 'շողք', 'գրկել', 'բանակ', 'ծառայել', 'գուցե', 'զգալ', 'զգացմունք', 'պահ', 'շոյել', 'միտք', 'կրկին', 'հավանել', 'թաքուն', 'կոկիկ', 'գաղտնի',
    'քարանալ', 'քարացած', 'ճամպրուկ', 'փոշեկուլ', 'բառախաղ', 'խաչբառ', 'ընկերական', 'գլուխ գովել', 'գլուխ պահել', 'երեսով տալ', 'էարոզել',
    'ցանել', 'հողամաս', 'հրամայել', 'փլվել', 'խաղադրույք', 'եկեղեցի', 'վանք', 'տաճար', 'խրճիթ', 'բնակավայր', 'հայրենիք', 'որբ', 'անտուն',
    'հոգեբուժարան', 'խնդրագիրք', 'սպասարկող', 'գովազդ', 'հրապարակել', 'հայտարարել', 'հայտարարություն', 'կանխիկ', 'ապառիկ', 'սահմանափակ',
    'վարժարան', 'թողնել', 'այրվել', 'հանկարծ', 'խոտ', 'ընտանեկան', 'մարել', 'հանգչել', 'վարարել', 'զորեղ', 'խոհարար', 'շինարար', 'տնօրեն',
    'լուռ', 'գրասեղան', 'հայլի', 'հմայել', 'հասցե', 'քարտ', 'փայտագործ', 'նկարիչ', 'հաշվապահ', 'կոստյում', 'դատարկություն', 'բառարան',
    'լեզվագռիվ', 'բերքառատ', 'ջերմոց', 'ձվածեղ', 'ձվաձև', 'գնդաձև', 'շեղանկյուն', 'զուգահեռ', 'հատված', 'հալվել', 'բաժակ', 'շիշ', 'շեղ', 'խենթ',
    'խելագար', 'գերել', 'գրող', 'պատմիչ', 'անտանելի', 'անհասանելի', 'մոտենալ', 'լեցուն', 'քրկոծել', 'օծել', 'օղակ', 'պարան', 'պահմտոցի', 'լաբիրինտ',
    'բռնոցի', 'հարկադիր', 'կոմպոզիտոր', 'այլ', 'դուդուկ', 'խորոված', 'խոր', 'խելացի', 'խելոք', 'խավիար', 'խնամքով', 'ցուցաբերել', 'ծաղկեփունջ',
    'փրկիչ', 'փչացնել', 'բացասական', 'դրական', 'քողարկել', 'ստույգ', 'կիսաբաց', 'լվացքի մեքենա', 'լվանալ', 'չորացնել', 'թռչել', 'թրջել', 'սովորել',
    'խրատել', 'մարզկենտրոն', 'քմահաճ', 'տհաճ', 'նեղանալ', 'պահանջ', 'միամիտ', 'վայելել', 'ջահել', 'գնալ', 'վերադառնալ', 'խիղճ', 'ամոթ',
    'ծանոթ', 'ուրիշ', 'գիժ', 'ագահ', 'անկուշտ', 'աբսուրդ', 'վանապետ', 'ադաթ', 'սովորույթ', 'սովորություն', 'սովոր', 'արտ', 'ցանքադաշտ', 'ֆերմա',
    'ագենտ', 'լրտես', 'շպիոն', 'հետախույզ', 'գործակալ', 'կենգուրու', 'ագեվազ', 'Ադամ', 'ադամանդ', 'ծովապետ', 'չամուսնացած', 'ազատագրել',
    'փրկել', 'ազատազրկել', 'փրկարար', 'ազատվել', 'միապետություն', 'հանրապետություն', 'համարձակություն', 'ճշմարտություն', 'ինքնագլուխ',
    'արձակել', 'պրծնել', 'էթնոս', 'ժողովուրդ', 'ցեղ', 'տոհմ', 'սերունդ', 'էպոս', 'գրագետ', 'արյունակից', 'համազգային', 'միջազգային', 'հայրենասեր',
    'ինքնասպան', 'ազդր', 'պետականացնել', 'ազգություն', 'դավաճան', 'ազդակ', 'գործոն', 'խթանել', 'աջակցել', 'հայտնել', 'հաղորդել',
    'ահազանգել', 'զգուշացնել', 'նախազգուշացնել', 'ներգործել', 'ներդնել', 'ներդրում', 'տպավորվել', 'ազդեցիկ', 'ներշնչել', 'նշանակություն', 'սրունք',
    'նմուշ', 'օրինակ', 'ընդօրինակել', 'ընտիր', 'ազնիվ', 'արդար', 'անկեղծ', 'ազդվել', 'ազդել', 'ազդեցություն', 'բարեկիրթ', 'բարեհոգի', 'պարկեշտ',
    'ազոտ', 'տհաս', 'չհասած', 'տորթ', 'թիթեղ', 'թիկնապահ', 'թիկնեղ', 'գանգռահեր', 'գահ', 'արքայություն', 'աթեիստ', 'գահակռիվ', 'վիթխարի',
    'հսկա', 'ահռելի', 'խոշոր', 'ալ', 'արյուն', 'արնաքամ', 'ալբոմ', 'հուշատետր', 'փոթորկել', 'խռովել', 'ծերունի', 'ծերուկ', 'ալեհեր', 'գունեղ', 'բազմերանգ',
    'ախոյան', 'հակառակորդ', 'ոսոխ', 'մրցակից', 'անուշահամ', 'լեռնագնացություն', 'արշավ', 'ախորժակ', 'ախարժելի', 'ախտ', 'բուժել', 'բուժում',
    'բժիշկ', 'վիրահատել', 'վիրահատություն', 'վիրաբույժ', 'բուժքույր', 'նվագել', 'անիծել', 'նզովել', 'պարապ', 'անբան', 'թափուր', 'մոլեգնել', 'մոլեգին',
    'անթիվ', 'կատարյալ', 'անթերի', 'հենարան', 'հենվել', 'անթև', 'թիկունք', 'ամբողջական', 'անժամանակ', 'սկավառակ', 'լճափ', 'արեգակ', 'լիալուսին',
    'մայրամուտ', 'արևածագ', 'գետեզր', 'փոշմանել', 'բևեռային', 'պալատ', 'վռնդել', 'սուգ', 'ողբալի', 'տարօրինակ', 'բացառիկ', 'արտառոց', 'անսովոր',
    'էական', 'արոտավայր', 'վտարել', 'բաց թողնել', 'չարիք', 'ձախողություն', 'դժբախտություն', 'փորձանք', 'աղետ', 'արհեստական', 'արհամարել',
    'լուսաբաց', 'հարձակվել', 'ծայրամաս', 'թուխ', 'շրջակայք', 'շրջակա', 'արդյունք', 'թափառական', 'արտացոլել', 'արդյունավետ', 'հասկանալի',
    'արտակարգ', 'դրսևորել', 'այլանդակ', 'անշնորք', 'արքայազն', 'աքաղաղ', 'մեխ', 'զարկերակ', 'բազմազավակ', 'մառախուղ', 'մշուշ', 'գավաթ',
    'կուժ', 'սափոր', 'գովասանագիր', 'բյուր', 'հոլով', 'իմաստուն', 'վաստակավոր', 'տաղանդավոր', 'խայտաբղետ', 'արտասանել', 'անմարդաբնակ',
    'համեստ', 'զրուցակից', 'խոստովանություն', 'ենթարկվել', 'դժգոհություն', 'դժգոհել', 'խցկել', 'մտորել', 'տնտեսել', 'կոպ', 'դեմք', 'կարծր',
    'համառոտ', 'տանջել', 'կողպեք', 'վերակենդանացնել', 'զորավար', 'ճարտարապետ', 'գծագիր', 'կարեկցել', 'ցավակցել', 'համտեսել', 'վերագրել',
    'համեմատաբար', 'համբույր', 'համեմել', 'պարկեշտ', 'չափ', 'հետևանք', 'հերթապահ', 'հարկ', 'հերքել', 'վեպ', 'վիպակ', 'խեղդել', 'հեղեղել',
    'ձիավոր', 'ասպետ', 'թափթփել', 'թափթփված', 'տառապել', 'ծաղրանք', 'կրկես', 'շնչասպառ', 'շնչակտուր', 'հալածել', 'նշույլ', 'ակսորել', 'ասեղ',
    'վատաբանել', 'հոգս', 'հոգատար', 'սրտանց', 'հոգնեցուցիչ', 'եղունգ', 'ողջույն', 'բազե', 'թարթել', 'հավաստի', 'շտկել', 'ճեղքել', 'մագաղաթ',
    'փաթաթվել', 'մակդիր', 'տիտղոս', 'մականուն', 'աննշան', 'մանկահասակ', 'մանկական', 'բծախնդիր', 'շտեմարան', 'բնագավառ', 'ոլորտ', 'փշուր',
    'հաճախակի', 'մոլեկուլ', 'մշտական', 'առասպել', 'դիցաբանություն', 'այրվել', 'միտումնավոր', 'դիտավորյալ', 'համաձայնություն', 'միանման',
    'կրակապաշտ', 'խելահեղ', 'գրավիչ', 'ապակողմնորոշել', 'սայթաքել', 'սաստիկ', 'հավերժական', 'անշեջ', 'հավետ', 'աճեցնել', 'հրաշագործ',
    'կնքել', 'միջնորդ', 'միջնորդել', 'բարեխոս', 'բարեխոսել', 'վհուկ', 'ամպոտ', 'որս', 'որսորդ', 'որսալ', 'որոշիչ', 'որդեգրել', 'որսաշուն', 'վիճակ',
    'հատկություն', 'պատ', 'պատնեշ', 'խայտաբղետ', 'ժիր', 'ձախորդ', 'դժբախտ', 'դժբախտություն', 'ապահով', 'բախտ', 'նենգություն', 'գերագնահատել',
    'թերագնահատել', 'ծայրահեղ', 'չվել', 'գնացք', 'չվերթ', 'հետաձգել', 'ժամանակակից', 'մեկնել', 'գեղեցկուհի', 'հսկիչ', 'հարկային', 'խնամել', 'պատսպարվել',
    'հաշմանդամ', 'բացակա', 'ներկա', 'բացակայել', 'բացակայություն', 'ներկայություն', 'սննդամթերք', 'պահեստ', 'անզգա', 'աղաչել', 'աղաչանք',
    'աղոթել', 'աղոթք', 'հյուրընկալել', 'զբաղվել', 'յուղոտ', 'շքանշան', 'ցատկոտել', 'իշխան', 'լուսանցք', 'պարանոց', 'զբաղմունք', 'տևողություն',
    'պատվավոր', 'ապաստան', 'պատմական', 'պատճառաբանել', 'պատկեր', 'պատկերազարդ', 'պատկերացնել', 'պատրաստել', 'գլխացավանք', 'ղեկավար',
    'գեր', 'գերի', 'ընծայել', 'թռչկոտել', 'ժայռ', 'պարեն', 'հիասթափություն', 'խաբկանք', 'ջահ', 'մատաղ', 'ձգտել', 'ջարդ', 'ջարդել', 'ջեռուցում',
    'տաքացում', 'ռադիո', 'ռեբուս', 'ռեժիմ', 'ռեժիսոր', 'ռոճիկ', 'ռազմիկ', 'ռազմավարություն', 'ռազմաճակատ', 'մարտահրավեր', 'մարտադաշտ',
    'բեմադրող', 'մրջյուն', 'ինֆուզորիա', 'հակազդեցություն', 'ռեակցիա', 'զինվորական', 'ամբոխ', 'ջրահարս', 'փերի', 'հեղուկ', 'քարանձավ', 'առու',
    'հերքել', 'առանձնացնել', 'բաժանել', 'պարզեցնել', 'ջոկատ', 'դասակ', 'նյարդային', 'դողալ', 'ջերմ', 'ջերմացնել', 'սեռ', 'սեր', 'սերտ', 'սեփական',
    'սեգ', 'կերտել', 'շինել', 'հնարել', 'թամադա', 'կաշկանդվել', 'կահույք', 'սրահ', 'սյուն', 'ձող', 'սունկ', 'սկսնակ', 'սկուտեղ', 'անփորձ', 'հիմնավորել',
    'զեփյուռ', 'անզոր', 'երկյուղել', 'փուչ', 'հանճար', 'գիտնական', 'գանձարան', 'մեծացնել', 'ճյուղ', 'սոսնձել', 'ստորադաս', '0սահնակ', 'ենթակա',
    'ստորոգյալ', 'զինել', 'ճերմակ', 'ծես', 'նախնի', 'ծառայել', 'սպի', 'վերք', 'վնասվածք', 'վերելք', 'հիշողություն', 'լրացնել', 'նախավերջին', 'համբարձվել',
    'զրույզ', 'վսեմ', 'դասել', 'գերադասել', 'վերածնունդ', 'ձևավոր', 'ձևավորել', 'տուֆ', 'մեղու', 'տույժ', 'վշտալի', 'րոպեական', 'րոպե', 'ստորին',
    'ցողել', 'բուն', 'անօդաչու թռչող սարք', 'շրջապատել', 'շրջափակում', 'խոչնդոտ', 'թակարդ', 'ձկնորսություն', 'խառնել', 'տոլմա', 'խաչքար', 'ցուլ',
    'քրոմ', 'ալյումին', 'պղինձ', 'անագ', 'սնդիկ', 'ուրան', 'գորշ ածուխ', 'մանգան', 'ֆոսֆոր', 'ծծումբ', 'սելիտրա', 'կերակրի աղ', 'տպարան', 'գրադարան',
    'գրադարանավար', 'միակ', 'ողջ', 'լաստանավ', 'կազմակերպություն', 'ջորի', 'Mercedes', 'BMW', 'Audi', 'Bugatti', 'Jeep', 'Lada', 'սպորտային մեքենա',
    'լիգա', 'սակավաթիվ', 'սլացիկ', 'զվարճալի', 'զվարճանք', 'ջինջ', 'զուլալ', 'վճիտ', 'բյուրեղային', 'բյուրեղ', 'կոկիկ', 'մաքրասեր', 'բորբոսնել', 'բորբոսնած',
    'մելամաղձոտ', 'տղամարդ', 'կին', 'մահկանացու', 'գթասիրտ', 'բնաջնջել', 'հաղթանդամ', 'մարմնավորել', 'բաղձանք', 'մագլցել', 'վանել', 'մագնիս', 'սառնարան',
    'շեղել', 'շեղվել', 'մոլագար', 'միամիտ', 'միջամտել', 'նախագիծ', 'նախագծել', 'նախապապ', 'հիմնադիր', 'հիմնախնդիր', 'յուրատեսակ', 'ռազմանավ',
    'նավթ', 'բնական գազ', 'նեղ', 'նեղացնել', 'վիրավորել', 'վիրավորվել', 'եղեռն', 'վաղեմի', 'նախատել', 'նախշ', 'նախշել', 'զարդարել', 'անգամ',
    'փոստատար', 'փոստ', 'նետվել', 'ներգաղթ', 'ներգաղթել', 'գաղթ', 'գաղթել', 'արտագաղթ', 'արտագաղթել', 'ներածություն', 'առաջաբան', 'նետաձիգ',
    'ավանդ', 'կլանել', 'հմուտ', 'հմտանալ', 'քաջածանոթ', 'ոգևորություն', 'նժույգ', 'նիհար', 'նիհարել', 'թարմ', 'նորույթ', 'նշանակություն', 'նշանակալից',
    'ջանք', 'դիմանկար', 'անտաղանդ', 'անընդունակ', 'բազմաշնորհ', 'ճառագայթ', 'ցնցում', 'ցնցել', 'տոթ', 'թույլատրել', 'ընծա', 'ընծայել', 'պիտանի',
    'պետքական', 'կաթսա', 'պարոն', 'աղա', 'պարկ', 'տոպրակ', 'քսակ', 'ուսապարկ', 'որոշակի', 'բացահայտ', 'լուսաբանել', 'տաքդեղ', 'աղոտ', 'աղտոտել',
    'պայթյուն', 'թագադրել', 'հանցանք', 'ջախջախել', 'խորտակվել', 'խորտակել', 'դյուցազն', 'խորամանկ', 'հին', 'հնավայր', 'մերժել', 'մերժված', 'խոստացած',
    'խոստանալ', 'խուսափել', 'մոլորված', 'կորած', 'հրդեհ', 'փորձանք', 'այրվող', 'ենթարկել', 'ցայտուն', 'աշնանային', 'ձմեռային', 'գարնանային', 'ամառային',
    'շաբաթօրյակ', 'շաբաթական', 'ամսական', 'օրական', 'խայթել', 'խայթող', 'օձիք', 'փողկապ', 'կարպետ', 'ծննդատուն', 'շուտափույթ', 'օդափոխել', 'օդափոխում',
    'օդափոխություն', 'ոսկերիչ', 'աստիճան', 'կերպարվեստ', 'տեխնոլոգիա', 'տեխնիկա', 'ակտիվ', 'պասիվ', 'ակտիվություն', 'ակտիվացնել', 'պասիվություն',
    'աշխատունակ', 'ալեկոծվել', 'ցունամի', 'խավար', 'խավարում', 'հարյուրամյակ', 'բռնցքամարտիկ', 'ուղղագրություն', 'քերականություն', 'հոմանիշ', 'հականիշ',
    'դարձվածք', 'դիմակահանդես', 'մետաղի ջարդոն', 'հարաբերական', 'տեսություն', 'գյուտ', 'գյուտարար', 'հարցական', 'համոզիչ', 'թերթ', 'գինետուն',
    'եկեղեցական', 'վանական', 'հանկարցակի', 'բարդությամբ', 'դրամական', 'օգնություն', 'խոսք', 'համապատասխան', 'սազել', 'սեփական', 'սեզոնային',
    'արտերկիր', 'գետաձի', 'գավառ', 'երկրամաս', 'նահանգ', 'մոնոպոլիա', 'հեղինակ', 'ստեղծող', 'քոլեջ', 'մասնաշենք', 'կարի մեքենա', 'լիազորություն',
    'կիսալուսին', 'կոկորդիլոս', 'ալեհեր', 'բրոնզ', 'միկրոբ', 'թռուցիկ', 'բար', 'արագիլ', 'բժշկական ստուգում', 'դամբուլ', 'ձվածեղ', 'մառան', 'նկուղ', 'հավաբուն',
    'ածելի', 'շրթներկ', 'անձնակազմ', 'քանակական', 'սեռական', 'գործիական', 'ոճրագործ', 'կմկմալ', 'գազան', 'ռադիոընդունիչ', 'արժույթ', 'նախադասություն',
    'սոցիալական քարտ', 'բանկային քարտ', 'խաղաքարտ', 'պաստառ', 'Բարեկենդան', 'մսուր', 'Վարդավառ', 'լեզվակ', 'ֆոտոլրագրող', 'պահակատուն',
    'սրբավայր', 'գերձայնային', 'գրոհ', 'թեզ', 'թիզ', 'շտկել', 'արմատական', 'խոռոչ', 'ծաղրել', 'կոթ', 'բամբասանք', 'լավաշ', 'գիտաժողով', 'թաթ',
    'սկանդալ', 'մեջբերում', 'արդուկել', 'մանդարին', 'խրթին', 'ջահ', 'ճանապարհորդություն', 'այցելու', 'կեչի', 'բարդի', 'սոչի', 'կապտուկ', 'ուրց',
    'ծիրանենի', 'գիլաս', 'ցոգոլ', 'դրամապանակ', 'անձրևաջուր', 'բարմեն', 'տրամաչափ', 'տրամագիծ', 'շառավիղ', 'շոշափող', 'գեներալ', 'հոգեվարք',
    'կնամոլ', 'անշարժ', 'հնագիտություն', 'հետաձգել', 'հավելանյութ', 'սկյուռիկ', 'գունանյութ', 'խնամված', 'մանրահատակ', 'կարպետ', 'կափարիչ',
    'անընդհատ', 'լուցկի', 'ժիր', 'կարճահասակ', 'հանկարծակիի գալ', 'գրագետ', 'բիծ', 'կարճաժամկետ', 'բեմադրում', 'ողբ', 'ակադեմիկոս', 'տկարամիտ',
    'ցուցահանդես', 'սնուցում', 'արտադրյալ', 'զորակցել', 'շարան', 'մնջախաղ', 'ծուղակ', 'ապտակ', 'անեկդոտ', 'պողոտա', 'ամսագիր', 'քաղցրավենիք',
    'սպա', 'ժամապահ', 'տարողունակ', 'ինդեքս', 'մորեխ', 'ետգրություն', 'գինեկոլոգ', 'կայծկլտել', 'բարեկամություն', 'քամել', 'քառամյա', 'քառյակ',
    'փայլեցնել', 'հաշմանդամ', 'կատաղել', 'պատմաբան', 'նյարդ', 'թափթփուկ', 'խզբզել', 'խոզանակ', 'մոտեցում', 'կնքամայր', 'կնքահայր', 'ֆիլտր', 'շաշկի',
    'տրամադրություն', 'կոտոշ', 'վարվել', 'ողորկ', 'խելառ', 'մակբայ', 'թմրանյութ', 'ուղեկցորդուհի', 'միջնադարյան', 'ծաղկեփունջ', 'խուճուճ', 'շերտ',
    'մարսել', 'մանկաբույժ', 'ետնաբեմ', 'սպանախ', 'թվջութակ', 'թավջութակահար', 'քաղաքակիրթ', 'քաղաքակրթություն', 'միջնորդել', 'անուշադիր', 'բջիջ',
    'քարավան', 'կորիզ', 'շալ', 'կամեցող', 'մարդահամար', 'եղևնի', 'կերակրափող', 'թաթար', 'պարսիկ', 'ֆլեյտա', 'նշաձող', 'զննել', 'անտրամաբանական',
    'աննման', 'զայրույթ', 'դուրեկան', 'գաղտնաբառ', 'ջերմաչափ', 'գունդ', 'ոլոռ', 'հասցեատեր', 'գիշատիչ', 'մրմնջալ', 'անվճարունակ', 'ցուցադրել', 'գլխապտույտ',
    'փնթփնթալ', 'տեղեկատու', 'գետնանուշ', 'ընդառաջ', 'հանրահաշիվ', 'ցախավել', 'կանթեղ', 'գուլպա', 'կոճ', 'անհերքելի', 'առակագիր', 'բարեհաճել',
    'ճենապակի', 'նորապսակ', 'պարզամիտ', 'գործադուլ', 'պանդոկ', 'անբնական', 'կաղնի', 'ժլատ', 'թունել', 'կեղծավոր', 'կրոն', 'տաքարյուն', 'նորաձև',
    'լծակ', 'անհեթեթություն', 'վզնոց', 'ընդարձակ', 'փունջ', 'ցավազրկող', 'բեռնաթափել', 'Խաղղողօրհնեք', 'սրտատրոփ', 'ցնցում', 'անհապաղ', 'ոսպ', 'տոնածառ',
    'մոմ', 'խաբուսիկ', 'վեր թռնել', 'ակրոբատիկա', 'բառախաղ', 'խտացրած կաթ', 'խճուղի', 'բնականաբար', 'կամար', 'քարոզ', 'մերկ', 'մեղրամիս', 'ատրճանակ',
    'փորագրել', 'բու', 'իշխանություն', 'զավեշտ', 'զավեշտալի', 'հերմետիկ', 'քիմիկոս', 'ֆիզիկոս', 'մաթեմատիկոս', 'երկնային', 'ջերմաքանակ', 'անկշիռ', 'անվավեր',
    'հապաղել', 'արագ սնունդ', 'վարակ', 'ակորդիոն', 'վթար', 'զղջում', 'ճվճվալ', 'ենթադրություն', 'արյունաքամ', 'անմտություն', 'պիղծ', 'ծախել', 'թիթեղ', 'թիթեղյա',
    'անկոտրում', 'լիմուզին', 'ոհմակ', 'հետևյալ', 'սիզամարգ', 'հուշարձան', 'շատակեր', 'նորաձևություն', 'հիմար', 'ռեֆլեքս', 'ագրեսիա', 'եռապատիկ', 'Հայաստան', 'Վրաստան', 'Երևան', 'Նորավանք', 'Թբիլիսի', 'Իջևան', 'Վայոց ձոր', 'Սյունիք', 'Արմավիր', 'Արարատ', 'Արմավիր', 'Արտաշատ', 'Կոտայք',
    'Լոռի', 'Շիրակ', 'Գեղարքունիք', 'Կապան', 'Եղեգնաձոր', 'Վայք', 'Ջերմուկ', 'Արտաշատ', 'Հրազդան', 'Գյումրի', 'Վանաձոր', 'Սևանա լիճ', 'Պարզ լիճ',
    'Արաքս գետ', 'Ախուրյան գետ', 'Արցախ', 'Տավուշ', 'Նոյեմբերյան', 'Աղավնաձոր', 'Ագարակաձոր', 'Մալիշկա', 'Եղեգիս', 'Գետափ', 'Ելփին', 'Արփա',
    'Գառնի', 'Բագարան', 'Տիգրանակերտ', 'Անի քաղաք', 'Վան քաղաք', 'Թալին', 'Բյուրական', 'Արենի', 'Ծաղկաձոր', 'Հանքավան', 'Արթիկ', 'Աշոցք',
    'Տաշիր', 'Ալավերդի', 'Գավառ', 'Վարդենիս', 'Նախիջևան', 'Ջավախք', 'Երկիր մոլորակ', 'Մերկուրի', 'Վեներա', 'Մարս', 'Յուպիտեր', 'Նեպտուն',
    'Պլուտոն', 'գալակտիկա', 'ծով', 'ծոց', 'գետ', 'լիճ', 'վտակ', 'մայրցամաք', 'աշխարհամաս', 'օվկիանոս', 'Թուրքիա', 'Անկարա', 'Ադրբեջան', 'Բաքու',
    'Կաբուլետի', 'Ռուսաստան', 'Մոսկվա', 'Սանկտ Պետերբուրգ', 'Նովոսիբիրսկ', 'Եկատիրինբուրգ', 'Յակուտսկ', 'Վոլգա', 'Օբ գետ', 'Բայկալ լիճ', 'Ենիսեյ',
    'Լենա գետ', 'Ասիա', 'Եվրասիա', 'Եվրոպա', 'Աֆրիկա', 'Ղազախստան', 'Նուր Սուլթան', 'Մոնղոլիա', 'Ուլան Բատոր', 'Հյուսիսային Կորեա', 'Փհենյան',
    'Հարավային Կորեա', 'Սեուլ', 'Ճապոնիա', 'Տոկիո', 'Հոկայդո կղզի', 'Չինաստան', 'Պեկին', 'Յանցզի', 'Նեպալ', 'Հնդկաստան', 'Դելլի', 'Մումբայ', 'Շանհայ',
    'Շրի Լանկա', 'Կոլոմբո', 'Մալդիվներ', 'Բութան', 'Բանգլադեշ', 'Դաքա', 'Մյանմար', 'Վիետնամ', 'Կամբոջա', 'Թաիլանդ', 'Մալազիա', 'Ինդոնեզիա',
    'Ջակարտա', 'Պակիստան', 'Իսլամաբադ', 'Աֆղանստան', 'Քաբուլ', 'Ղրղստան', 'Բիշքեկ', 'Ուզբեկստան', 'Աստանա', 'Թուրքմենստան', 'Աշխաբադ', 'Տջիկստան',
    'Իրան', 'Թեհրան', 'Լիբանան', 'Իսրայել', 'Հորդանան', 'Քատար', 'Արաբական Միացյալ Էմիրություններ', 'Իրաք', 'Բաղդադ', 'Սաոիդյան Արաբիա',
    'Էր Ռիադ', 'Եմեն', 'Օման', 'Աբու Դաբի', 'Դուբայ', 'Կիպրոս', 'Նիկոսիա', 'Նորվեգիա', 'Օսլո', 'Շվեդիա', 'Ստոկհոլմ', 'Ֆինլանդիա', 'Հելսիննկի',
    'Վոլգոգրադ', 'Դոնի Ռոստով', 'Դանիա', 'Կոպենհագեն', 'Էստոնիա', 'Տալլին', 'Լատվիա', 'Լիտվա', 'Ռիգա', 'Վիլնյուս', 'Իռլանդիա', 'Դուբլին', 'Իսլանդիա',
    'Ռեյկյավիկ', 'Մեծ Բրիտանիա', 'Լոնդոն', 'Լիվեռպուլ', 'Մանչեստեր', 'Շոտլանդիա', 'Անգլիա', 'Ուելս', 'Բելառուս', 'Մինսկ', 'Ուկրաինա', 'Կիև', 'Լեհաստան',
    'Վարշավա', 'Չեխիա', 'Պրահա', 'Սլովակիա', 'Սոֆիա', 'Ռումինիա', 'Բուլղարիա', 'Հունաստան', 'Աթենք', 'Իտալիա', 'Հռոմ', 'Թուրին', 'Միլան',
    'Սան Մարինո', 'Վատիկան', 'Խորվաթիա', 'Մակեդոնիա', 'Գերմանիա', 'Բեռն', 'Բեռլին', 'Ֆրանսիա', 'Փարիզ', 'Բելգիա', 'Բրյուսել', 'Հոլանդիա',
    'Իսպանիա', 'Մադրիդ', 'Բարսելոնա', 'Պորտուգալիա', 'Լիսաբոն', 'Ավստրիա', 'Շվեցարիա', 'Ալժիր', 'Եգիպտոս', 'Կահիրե', '7 հրաշալիք', 'Նիգեր',
    'Եթովպիա', 'կլիմա', 'կղզի', 'օգտակար հանածոներ', 'լանդշաֆտ', 'լեռ', 'ձոր', 'իջվածք', 'Ավստրալիա', 'Նոր Գվինեա', 'Նոր Զելանդիա', '',
    'Կանբեռա', 'Բրազիլիա', 'Արգենտինա', 'Ուրուգվայ', 'Պարագվայ', 'Շիլի', 'Բոլիվիա', 'Պերու', 'Էկվադոր', 'Կոլումբիա', 'Վենեսուելլա', 'Մոնտեվիդեո',
    'Բուենոս Այրես', 'Սանտյագո', 'Լիմա', 'Բոգոտա', 'Կարակաս', 'ԱՄՆ', 'Կանադա', 'Մեքսիկա', 'Կուբա', 'Օտտավա', 'Վաշինգտոն', 'Լոս Անջելես',
    'Նյու Յորք', 'Մեխիկո', 'Անտարկտիդա', 'Պիրենեյան թերակղզի', 'Գրենլադիո կղզի', 'Սկանդինավյան լեռներ', 'Արաբական թերակղզի', 'Կարպատներ',
    'Ուրալյան Լեռներ', 'Միջագետք', 'Բալկանյան թերակղզի', 'Ապենինյան թերակղզի', 'Դեկանի սարահարթ', 'Կամչատկա թերակղզի', 'Ֆուձիամա հրաբուխ',
    'Հնդկաչին թերակղզի', 'Կիլիմանջարո', 'Ջոմոլունգմա', 'Էվերեստ', 'Ճայա կղզի', 'Յանցզի գետ', 'Հուանհե գետ', 'Ամուր գետ', 'Բերինգի նեղուց', 'նեղուց',
    'Օխոտի ծով', 'Կասպից ծով', 'Սև ծով', 'Պարսից ծոց', 'Կարմիր ծով', 'Դանուբ գետ', 'Ջիբլարթարի նեղուց', 'Ատլանտյան օվկիանոս', 'Խաղաղ օվկիանոս',
    'Հնդկական օվկիանոս', 'Հյուսիսային Սառուցյալ օվկիանոս', 'Վանա լիճ', 'Ուրմիա լիճ', 'Արաբական ծով', 'Սահարա անապատ', 'Ատլասի լեռներ',
    'Դրակոնյան լեռներ', 'Նեղոս գետ', 'Կոնգո գետ', 'Պարանա գետ', 'Ամազոն գետ', 'Անդեր', 'Տիտիկական լիճ', 'Միսիսիպի գետ', 'Բոսֆորի նեղուց', 'Ապալանչներ',
    'Մեքսիկական ծոց', 'Կարիբյան ծով', 'հարթավայր', 'սարահարթ', 'քարտեզ', 'գլոբուս', 'Աշխարհագրություն', 'Եգիպտական բուրգեր', 'Ալեքսանդրիայի փարոս',
    'Զևսի արձան', 'Հռոդոսի կոթող', 'Շամիրամի կախովի այգիներ', 'Արտեմիսի տաճար', 'ջրվեժ', 'քաղաք', 'Վիկտորիա ջրվեժ', 'Ստամբուլ', 'Բուդապեշտ',
    'Սլովակիա', 'Մոնակո', 'Անդորրա', 'Սեվիլիա', 'Պորտու', 'Նիգերիա', 'Հարավաֆրիկյան հանրապետություն', 'Մադագասկար', 'Մարիանյան իջվածք',
    'Պանամա', 'Սան-Մարինո', 'Ուրան մոլորակ', 'լուսին', 'արբանյակ', 'արգելոց', 'բարձրավանդակ', 'Կինշասա', 'Դրակոնյան լեռներ', 'Տանզանիա', 'Զամբեզի գետ',
    'Բամակո', 'Հոկայդո կղզի', 'Կյուսու կղզի', 'Սիկակու կղզի', 'Ֆիլիպիններ', 'Իրանական սարահարթ', 'Չուկոտյան թերակղզի', 'Միջին Սիբիրային սարահարթ',
    'Կովկաս', 'Կոորդիլիերներ', 'Ամազոնի դաշտավայր', 'Բենգալյան ծով', 'Մեծ Արջի լիճ', 'Արաբական ծով', 'Մեքսիկական ծոց', 'Կարիբյան ծով',
    'Հուդզոնի ծոց', 'Միչիգան լիճ', 'Միչիգան', 'Կալիֆորնիա', 'Կալիֆորնիայի թերակղզի', 'Նոր Զելանդիա կղզիներ', 'Գանա', 'Մավրիտանիա', 'Սուդան', 'Սոմալի',
    'Զամբիա', 'Կամերուն', 'Սուրինամ', 'Բութան', 'Ճամայկա', 'Սալվադոր', 'Ավստրիա', 'Սերբիա', 'Ալբանիա', 'Կրակատու հրաբուխ', 'Կոսցյուշկո լեռ', 'Էթնա հրաբուխ',
    'Հեկլա հրաբուխ', 'Ակոնկագուա լեռ', 'Մակ-Քինլի լեռ', 'կլիմայական գոտի', 'բնական զոնա', 'Դեկանի սարահարթ', 'Բալխաշ լիճ', 'Հիմալայներ',
    'Նորվեգական ծով', 'Դնեպր', 'Դանուբ', 'Բոսֆորի նեղուց', 'Տիգրիս', 'Եփրատ', 'Գնդեվազ', 'Վարդենիս', 'Որոտան', 'Սիսիան', 'Գորիս', 'Մեղրի',
    'Բերձոր', 'Քաջարան', 'Կապուտջուղ լեռ', 'Հալիձոր', 'Շուշի', 'Ստեփանակերտ', 'Մարտունի', 'Ասկերան', 'Մարտակերտ', 'Քաշաթաղ', 'Մասիս', 'Արարատ', 'Սիս',
    'Գոգի լեռ', 'Վեդի', 'հէկ', 'ջէկ', 'աէկ', 'Մեծամոր', 'Վաղարշապատ', 'Մատենադարան', 'Փամբակ', 'Աժդահակ լեռ', 'Նոր Հաճն', 'Աբովյան', 'Արագած լեռ',
    'Արփա լիճ', 'Չարենցավան', 'Սիդնեյ', 'Էյֆելյան աշտարակ', 'Ազատության արձան', 'Չինական մեծ պատ', 'Թաջ Մահալ', 'Պիզայի աշտարակ', 'Բիգ Բեն',
    'հայ', 'վրացի', 'ռուս', 'անգլիացի', 'ամերիկացի', 'եվրոպացի', 'աֆրիկացի', 'ազգ', 'իսպանացի', 'պորտուգալացի', 'ֆրանսիացի', 'գերմանացի', 'իտալացի',
    'կորեացի', 'ճապոնացի', 'չինացի', 'բրազիլացի', 'ուկրաինացի', 'արգենտինացի', 'կանադացի', 'Հիսուս Քրիստոսի արձան', 'Սպիտակ տուն', 'շվեցարական բանկ',
    'Ազգային ժողով', 'հանրապետության հրապարակ', 'Հոլիվուդ', 'Դսեղ', 'Գառնու տաճար', 'Սուեզի ջրանցք', 'Ֆլորենցիա', 'Սիդնեյ', 'Նջամենա', 'Կոնգո', 'Բաբելմանդեբի նեղուց',
    'Պրետորիա', 'Մուշ', 'Վան', 'Գանգես գետ', 'Ինդոս գետ', 'Կրակատու հրաբուխ', 'Փոքր Ասիա', 'Էլբրուս լեռ', 'Սիցիլիա կղզի', 'Օնեգա գետ', 'Մալթա', 'Վալետա',
    'Վիեննա', 'ԼՂՀ', 'Թհիմպու', 'Օրինոկո գետ', 'Լա Պլատայի դաշտավայր', 'հասարակածային գոտի', 'մերձհասարակածային գոտի', 'արևադարձային գոտի', 'բարեխառն գոտի',
    'Սոմալի', 'Քենիա', 'Չադ', 'Չեռնոգորիա', 'Գվատեմալա', 'Եմեն', 'Google', 'Yandex', 'Facebook', 'Instagram', 'Opera', 'Apple', 'Samsung', 'Xiaomi', 'Lenovo', 'Huawei', 'Hisense', 'Adidas', 'Nike', 'Puma', 'Amazon', 'Microsoft',
    'Beeline', 'Volvo', 'Mercedes', 'BMW', 'Bugatti', 'Lamborghini', 'Porsche', 'Lada', 'Volkswagen', 'Ford', 'Ferrari', 'Tesla', 'Honda', 'Toyota', 'Bentley', 'Maseraty', 'Opel',
    'Audi', 'Lexus', 'Jeep', 'Cadillac', 'Hyundai', 'Jaguar', 'Mazda', 'Mustang', 'Nissan', 'Chevrolet', 'KIA', 'Mitsubishi', 'Suzuki', 'Range Rover', 'Firefox', 'Safari', 'Internet Explorer',
    'Youtube', 'Yahoo!', 'Wikipedia', 'Windows', 'Android', 'IOS', 'Netflix', 'VK', 'Twitch', 'Twitter', 'AliExpress', 'Adobe', 'Lego', 'Nokia', 'Coca Cola', 'Pepsi', 'Sprite', 'Fanta',
    'Disney', 'Visa', 'McDonalds', 'hp', 'LG', 'PayPal', 'Watsapp', 'Viber', 'TikTok', 'Telegram', 'Disney', 'Sony', 'Rakuten', 'Visa', 'Orange', 'Grand Candy', 'UCom', 'Jermuk Group',
    'Vivaro', 'Toto gaming', 'Adjarabet', 'GAZprom', 'Orbit', 'Dirol', 'Lays', 'VivaCell', 'Multi Group', 'Head & Shoulders', 'Colgate', 'Blendamed', 'Paracetamol', "Levi's",
    'Louis Vuitton', 'Fila', 'Lacoste', 'Prada', 'Gucci', 'NASA', 'Playstation', 'Nescafe', 'Skype', 'Red Bull']


let gameSettings = {
    time: 0,
    players: 0,
    unknowns: 0,
    word: '',
    steps: []
}
let t; // for timer

// ========================== Start button
document.querySelector('.start-btn').addEventListener('click', () => {
    if (+document.querySelector('.time').value && +document.querySelector('.players').value &&
        +document.querySelector('.players').value > +document.querySelector('.unknowns').value) {
        gameSettings.time = +document.querySelector('.time').value || 0
        gameSettings.players = +document.querySelector('.players').value || 0
        gameSettings.unknowns = +document.querySelector('.unknowns').value || 0

        randomUnknownsCount()

        let randomNum = Math.floor(Math.random() * words.length - 1)
        gameSettings.word = words[randomNum]

        document.querySelector('.home').style.display = 'none'
        document.querySelector('.board').style.display = 'flex'

        gameSettings.steps.length = gameSettings.players
        gameSettings.steps.fill(0)
        function randomOrder(steps) {
            let arr = Array(gameSettings.players)
            for (let i = 0; i < gameSettings.players; i++) {
                arr[i] = i + 1
            }
            let obj = {}
            for (let i = 0; i < gameSettings.unknowns; i++) {
                obj[i + 1] = 'unknown'
            }
            arr.sort(() => Math.random() - 0.5)
            arr.forEach((item, i) => {
                if (Object.keys(obj).includes(String(item))) arr[i] = 'Լրտես 🤐'
            })
            steps = [...arr]
            return steps
        }
        gameSettings.steps = randomOrder(gameSettings.steps)

        if (typeof gameSettings.steps[gameSettings.players - 1] != 'number') {
            document.querySelector('.word').innerHTML = gameSettings.steps[gameSettings.players - 1]
        }
        else document.querySelector('.word').innerHTML = gameSettings.word

        gameSettings.players--
    }
})

// ========================== Restart button
document.querySelector('.restart').addEventListener('click', () => {
    document.querySelector('.home').style.display = 'flex'
    document.querySelector('.board').style.display = 'none'

    // document.querySelector('.time').value = ''
    // document.querySelector('.players').value = ''
    // document.querySelector('.unknowns').value = ''

    document.querySelector('.start').style.display = 'none'
    document.querySelector('.open-close-word').style.display = 'block'
    document.querySelector('.word').style.display = 'block'
    document.querySelector('.timer').style.display = 'none'
    clearInterval(t)

    document.querySelector('.open-close-word').innerHTML = 'Փակել'
    document.querySelector('.last-word').innerHTML = gameSettings.word
    showWord = true
    gameSettings = {
        time: 0,
        players: 0,
        unknowns: 0,
        word: '',
        steps: []
    }
})

let showWord = true

// ========================== Open-Close button
document.querySelector('.open-close-word').addEventListener('click', () => {
    if (showWord) {
        document.querySelector('.word').innerHTML = '🎁'
        document.querySelector('.open-close-word').innerHTML = 'Բացել'
        if (gameSettings.players === 0) {
            document.querySelector('.open-close-word').style.display = 'none'
            document.querySelector('.start').style.display = 'block'
        }
    } else if (gameSettings.players) {
        if (typeof gameSettings.steps[gameSettings.players - 1] != 'number') {
            document.querySelector('.word').innerHTML = gameSettings.steps[gameSettings.players - 1]
        }
        else document.querySelector('.word').innerHTML = gameSettings.word

        document.querySelector('.open-close-word').innerHTML = 'Փակել'
        gameSettings.players--
    }
    showWord = !showWord
})

// =============================== Start Game
document.querySelector('.start').addEventListener('click', () => {
    document.querySelector('.open-close-word').style.display = 'none'
    document.querySelector('.word').style.display = 'none'
    document.querySelector('.start').style.display = 'none'

    let timer = [0, 0]

    while (gameSettings.time >= 60) {
        gameSettings.time -= 60
        timer[0]++
    }
    timer[1] = gameSettings.time

    t = setInterval(() => {
        timer[0] = +timer[0]
        timer[1] = +timer[1]
        if (timer[1] > 0) timer[1]--
        else if (timer[0] > 0) {
            timer[0]--
            timer[1] = 59
        }
        else {
            document.querySelector('.word').innerHTML = gameSettings.word + ` (Լրտեսները - ${gameSettings.unknowns})`
            document.querySelector('.word').style.display = 'block'
            clearInterval(t)
        }
        if (timer[0] < 10 && timer[0] > -1) timer[0] = '0' + timer[0]
        if (timer[1] < 10 && timer[1] > -1) timer[1] = '0' + timer[1]
        document.querySelector('.timer').innerHTML = `${timer[0]} : ${timer[1]}`
    }, 1000)

    if (timer[0] < 10 && timer[0] > -1) timer[0] = '0' + timer[0]
    if (timer[1] < 10 && timer[1] > -1) timer[1] = '0' + timer[1]
    document.querySelector('.timer').innerHTML = `${timer[0]} : ${timer[1]}`
    document.querySelector('.timer').style.display = 'block'
})

// ============ Random unknowns mode function
function randomUnknownsCount() {
    if (document.querySelector('.random-unknowns').checked || document.querySelector('.unknowns').value == '') {
        let secretCount = randomIntFromInterval(1, Math.floor(+document.querySelector('.players').value / 2))
        gameSettings.unknowns = secretCount
    }
}

// === Generate random number
function randomIntFromInterval(min, max) { // min and max included 
    return Math.floor(Math.random() * (max - min + 1) + min)
}